Revit 2024 API
BuiltInFailures.SketchFailures.ClosedProfileRoof Property
 Extrusion roof sketch must be open. The roof's thickness and material composition are defined in its type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ClosedProfileRoof { get; }
Visual Basic
Public Shared ReadOnly Property ClosedProfileRoof As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ClosedProfileRoof {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace